import 'package:flutter/material.dart';
import '../../models/style.dart';

class InfoContentPage extends StatelessWidget {
  final String? subtitle;
  final num? mode;

  const InfoContentPage({Key? key, required this.subtitle, required this.mode})
      : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      extendBodyBehindAppBar: true,
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        elevation: 0,
        centerTitle: true,
        title: Text(subtitle!),
      ),
      body: Stack(children: [
        Container(
            height: 250,
            width: double.infinity,
            color: ColorTheme.bgGreenColor),
        Opacity(
          opacity: 0.05,
          child: Container(
            height: 1000,
            width: double.infinity,
            decoration: const BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/img/bgApp1.jpg"),
                fit: BoxFit.cover,
              ),
            ),
          ),
        ),
        Padding(
          padding: const EdgeInsets.only(top: kToolbarHeight + 16.0),
          child: ListTile(
            title: Container(
              padding: const EdgeInsets.all(10),
              decoration: BoxDecoration(
                  color: Colors.white,
                  borderRadius: BorderRadius.circular(3),
                  boxShadow: [
                    BoxShadow(
                      color: Colors.grey.withOpacity(0.3),
                      spreadRadius: 2,
                      blurRadius: 5,
                      offset: const Offset(0, 3),
                    )
                  ]),
              child: Row(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                children: [
                  if (mode == 1)
                    Flexible(
                        child: SingleChildScrollView(
                      child: Column(children: [
                        _buildListItem(
                          context,
                          'การตั้งท่าและความมั่นคง',
                          'ท่ายิงมีความสำคัญต่อการยิงเป็นอย่างยิ่งเพราะการตั้งท่าที่ดีนั้นจะก่อให้เกิดความสมดุลและความมั่นคงของร่างกายและมือ โดยมีวิธีการตั้งท่าเบื้องต้นคือ',
                          [
                            'วางเท้าให้ห่างกันเท่ากับความกว้างของหัวไหล่',
                            'ให้น้ำหนักตัวและปืน ตกลงบนขาทั้งสองข้าง',
                            'แขนที่ใช้ยิงจะต้องเหยียดเต็มที่ พร้อมทั้งข้อมือและข้อศอกจะต้องนิ่งที่สุด',
                          ],
                        ),
                        _buildListItem(
                          context,
                          'การจับปืน ',
                          'การจับปืนที่ถูกต้องเบื้องต้นคือ',
                          [
                            'ให้ทำมือเป็นรูปตัว “V”',
                            'นำด้ามปื นสอดเข้าอุ้งมือ',
                            'ให้แนวของลำกล้องขนานกันเขน และส่วนบนของมือเสมอกับส่วนบนของด้ามปืน',
                            'ใช้นิ้วกลาง นิ้วนาง และนิ้วก้อยกำด้ามปืน',
                            'นิ้วชี้เมื่อยังไม่ใช้ให้วางไว้ข้างปืนเหนือโกร่งไกปืน',
                            'นิ้วหัวแม่มือควรเหยียดตรงและวางแนบข้างปืน',
                            'การแตะไกรปืน ให้ใช้นิ้วชี้ข้อปลายส่วนกลางข้อแตะที่ไกปืน',
                          ],
                        ),
                        _buildListItem(
                          context,
                          'การเล็ง',
                          'การจัดให้ลำกล้องปืนชี้ไปยังเป้ายิง ซึ่งมีสูตรการเล็งอยู่ว่า “หลับตาซ้าย เล็งด้วยตาขวา ให้ยอดศูนย์หน้าอยู่กึ่งกลางช่องบากศูนย์หลังเสมอ วางไว้ส่วนล่างของที่หมาย”',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'การยิง',
                          'ขั้นตอนการยิงปืนพื้นฐานคือ',
                          [
                            'นำมือที่ไม่ใช้ยิงหยิบปืน แล้วนำไปวางในมือที่ใช้ยิง',
                            'ตรวจสอบศูนย์ปืน',
                            'ตรวจสอบศูนย์ปืน',
                            'หายใจลึกๆประมาณ 2 ครั้ง',
                            'หายใจครั้งที่ 3 พร้อมยกปืนขึ้น เมื่อถึงเป้าหมายให้หายใจออก',
                            'ค่อยๆสัมผัสไกปืน',
                            'เล็งไปยังจุดเป้าหมาย',
                            'กดไกปืนอย่างนุ่มนวล',
                            'รักษาสภาพการยิงให้ยังคงนิ่งอยู่',
                            'ค่อยๆลดมือลง จากนั้นจึงทำการวิเคราะห์การยิง',
                          ],
                        ),
                        Text('References from วิธียิงปืนเบื้องต้น - Medium')
                      ]),
                    )),
                  if (mode == 2)
                    Flexible(
                        child: SingleChildScrollView(
                      child: Column(children: [
                        Text(
                            '  สิ่งแรกที่ควรเรียนรู้และต้องฝึกให้เป็นสัญชาตญาณเกี่ยวกับอาวุธปืนคือ กฎแห่งความปลอดภัยโดยกฏความปลอดภัยเบื้องต้นมีทั้งหมด 10 ข้อคือ '),
                        _buildListItem(
                          context,
                          'ข้อที่ 1. ปฏิบัติต่อปืนทุกกระบอกเหมือนปืนนั้นบรรจุกระสุนไว้',
                          'เพราะในบางครั้งมันจะเป็นปืนบรรจุกระสุนจริงๆแม้ว่าคนอื่นจะบอกว่า “ไม่ได้ใส่ลูก” ก็ตาม  ไม่ว่าจะหยิบปืนมาจากไหน หยิบเพื่อทำอะไร ปฏิบัติต่อปืนทุกกระบอกเหมือนปืนนั้นบรรจุกระสุนไว้เสมอ ',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อที่ 2. ไม่หันปากกระบอกปืนไปทางสิ่งไหนที่คุณไม่ต้องการจะยิง',
                          'ไม่หันปืนใส่คน, สิ่งมีชีวิตหรือสิ่งของใดๆที่ไม่ต้องการยิง แม้ว่าปืนนั้นจะไม่ได้บรรจุลูกกระสุน',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อที่ 3. นิ้วอยู่นอกโกร่งไกจนกว่าศูนย์เล็งจะทาบเป้า',
                          'ปืนบางกระบอกไกปืนเบามาก หรืออาจจะชำรุด อาจจะลั่นโดยที่เราไม่ได้ตั้งใจ',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อที่ 4 ตรวจดูเป้าที่จะยิงให้ชัดเจน และตรวจด้านหลังเป้าด้วย',
                          'ตรวจว่าเป้าคือสิ่งที่ต้องการยิงจริง และไม่มีสิ่งอื่นอยู่ในแนวกระสุน ให้แน่ใจว่ากระสุนมีสิ่งที่จะหยุดมันได้อย่างปลอดภัย',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 5 เลิกบรรจุเมื่อเลิกใช้อาวุธปืน ',
                          'หลังจากการฝึกซ้อม เลิกบรรจุ ตรวจอาวุธปืนทันที่ เมื่ออยู่ที่บ้าน เก็บปืนที่ไม่ต้องการใช้ แยกจากกระสุน และให้แน่ใจว่าพ้นมือเด็ก',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 6 อย่าฝากชีวิตไว้กับระบบเซฟ',
                          'ระบบเซฟของปืนเป็นกลไกอย่างหนึ่ง ชำรุดได้ เสียได้ ควรยึดมั่นตามกฏความปลอดภัยข้อ 1 ถึง 4 เข้าไว้',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 7 ใช้กระสุนที่ถูกต้องกับปืน',
                          'ตรวจสอบให้แน่ใจว่ากระสุนที่ใช้เป็นกระสุนที่ถูกต้องเหมาะกับปืนทั้งขนาด, ความแรง และรายละเอียดอื่นๆ',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 8 ตรวจว่าไม่มีสิ่งใดกีดขวางลำกล้องทุกครั้งเมื่อนำปืนออกมายิง',
                          'หากเราทำการยิงปืนในขณะที่มีสิ่งอุดขวางลำกล้อง เช่นเศษผ้าทำความสะอาด หรือหัวกระสุนที่มีปัญหาออกไม่พ้นลำกล้อง ลำกล้องอาจจะบวมแตกได้ อันตรายอย่างมาก',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 9 สวมใส่อุปกรณ์ป้องกัน เช่นแว่นตาและที่ครอบหูเสมอ',
                          'เนื่องจากอาวุธปืนมีเสียงดังและอาจมีสะเก็จจากปลอกกระสุนปืนเราจึงควรสวมใส่เครื่องป้องกันเพื่อกันอวัยวะเสียหายจากอุบัติเหตุได้',
                          [],
                        ),
                        _buildListItem(
                          context,
                          'ข้อ 10  ไม่ดื่มหรือเสพของมึนเมาเมื่อใช้อาวุธปืน ',
                          'การใช้อาวุธปืนให้ปลอดภัย ต้องการใส่ใจ และความคิดที่รอบคอบ การมึนเมาทำให้เกิดความผิดพลาดได้ง่ายและอาจจะนำไปสู่อุบัติเหตุ',
                          [],
                        ),
                        const Text(
                            'Reference from https://thailandoutdoor.com/2020/04/11/gun-safety-rules/'),
                      ]),
                    )),
                  if (mode == 3)
                    Flexible(
                        child: SingleChildScrollView(
                            child: Column(children: [
                      _buildListItem(
                        context,
                        'การทดสอบยิงปืนระบบการยิงปืนพกต่อสู้ขั้นพื้นฐาน (Basic Combat)',
                        '1. การแต่งกาย แต่งกายด้วยชุดฝึก ที่ผู้ฝึกรู้สึกเคลื่นที่ได้คล่องแคล่วและอยู่ในกฏระเบียบความเรียบร้อย',
                        [],
                      ),
                      const Padding(
                        padding:
                            EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                        child: Text(
                            '2. อาวุธปืน อาวุธปืนพกกึ่งอัตโนมัติ ขนาด 9 ม.ม. ,11 ม.ม.หรือ ขนาด .40 นิ้ว ลำกล้องมีความยาวไม่เกิน 5.5 นิ้ว ไม่มีการเจาะรูเพื่อลดแรงสะบัด น้ำหนักไกปืนต้องไม่น้อยกว่า 3.5 ปอนด์ อาวุธปืนต้องไม่ติดเครื่อง ช่วยเล็งหรืออุปกรณ์เสริมใด ๆ ไม่มีการถ่วงน้ำหนักที่อาวุธปืน ซองกระสุนปืน จำนวน 2 ซอง '),
                      ),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              '3. กระสุนปืน กระสุนปืน จำนวน 30 นัด ไม่มีกระสุนปืนสำรองติดตัว และห้ามนำมาเกิน สามารถนำกระสุนปืน มาเองได้ ')),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              '4. เป้าปืน เป้าหุ่นเงาคน มีคะแนน 3 คะแนน และ 7 ถึง 10 คะแนน')),
                      _buildListItem(
                        context,
                        'ท่าทางการยิง ',
                        'อาวุธปืนบรรจุกระสุนปืนพร้อมยิง เก็บปืนใส่ซอง ยืนในท่าตรง ',
                        [
                          'อาวุธปืนประเภท Single Action ให้ขึ้นระบบห้ามไกปืน',
                          'อาวุธปืนประเภท Double Action ให้ทำการลดนกปืน '
                        ],
                      ),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'ท่าทางการยิง ทำการยิงในระดับหัวไหล่ แนวปืนชี้ไปยังแนวเป้า ถ้าการปฏิบัติของผู้เข้าทำ การทดสอบ ผู้ควบคุมการยิงเห็นว่าไม่ปลอดภัยน่าจะเป็นอันตราย มีสิทธิ์ให้ออกจากการทดสอบ')),
                      _buildListItem(
                        context,
                        'การนับคะแนน',
                        '',
                        [
                          'นับคะแนนในเป้าหุ่นเงาคนครึ่งตัว บริเวณพื้นที่ตามที่ปรากฏบนตัวเป้า',
                          'การนับคะแนนให้นับคะแนนตามเส้นเขตที่แบ่งไว้ในเป้า ถ้ารอยกระสุนปืนสัมผัสเส้น แบ่งเขตเป้า ให้ถือค่าคะแนนตามบริเวณคะแนนที่สูงกว่า',
                          'ห้ามใช้อุปกรณ์อย่างใดอย่างหนึ่งแตะต้องหรือสัมผัสรอยกระสุนปืนบนแผ่นเป้า ตรวจสอบ พบถือเป็นโมฆะ',
                          'คะแนนเต็ม แต่ละเป้า เป็น 100 คะแนน รวมจำนวน 3 เป้า คิดเป็น 300 คะแนน',
                          'กรณีรอยกระสุนปืนเกินอยู่ในเป้า : ตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวา ถ้ามีรอยกระสุนปืนในเป้า ของทางซ้ายหรือขวาไม่ครบ ให้ตัดคะแนนของรอยกระสุนปืนที่ได้คะแนนต่ำสุดที่ปรากฏในเป้าที่เกินออกไปและถ้าตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวาแล้ว ปรากฏว่ามีรอยกระสุนปืน ของเป้าทางซ้ายและขวาครบ ให้ตัดคะแนนสูงสุดของรอยกระสุนปืนที่เกินออกไป',
                        ],
                      ),
                      _buildListItem(
                        context,
                        'การทดสอบยิงปืนระบบการยิงปืนพกต่อสู้ แบบสัญชาติญาณ (ไอ.พี.ที.). ',
                        '',
                        [
                          'การแต่งกาย แต่งกายด้วยชุดฝึก ที่ผู้ฝึกรู้สึกเคลื่นที่ได้คล่องแคล่วและอยู่ในกฏระเบียบความเรียบร้อย	',
                          'อาวุธปืน อาวุธปืนพกกึ่งอัตโนมัติ ขนาด 9 ม.ม. ,11 ม.ม.หรือ ขนาด .40 นิ้ว ลำกล้องมีความยาวไม่เกิน 5.5 นิ้ว ไม่มีการเจาะรูเพื่อลดแรงสะบัด น้ำหนักไกปืนต้องไม่น้อยกว่า 3.5 ปอนด์ อาวุธปืนต้องไม่ติดเครื่องช่วยเล็ง หรืออุปกรณ์เสริมใดๆ ไม่มีการถ่วงน้ำหนักที่อาวุธปืน ',
                          'ซองปืน เป็นซองพกนอกคาดติดเข็มขัดด้านที่ถนัด ห้ามใช้ซองพกต่ำ ห้ามผูกติดขา ห้ามใช้ซองปืนเปิด ด้านหน้า ซองปืนจะต้องแนบชิดเข็มขัดตั้งตรงแนวตะเข็บกางเกง ไม่เอียง ซองปืนจะต้องหุ้มโกร่งไกปืนและ ด้ามปืนต้องไม่ต่ำกว่าแนวขอบเข็มขัดด้านบน ',
                          'กระสุนปืน กระสุนปืน จำนวน 50 นัด ไม่มีกระสุนปืนสำรองติดตัว และห้ามนำมาเกิน สามารถนำกระสุนปืนมาเองได้ ',
                          'ซองใส่ซองกระสุนปืน ต้องคาดติดกับเข็มขัดข้างลำตัวห้ามใช้ชนิดแม่เหล็ก ',
                          'เป้าปืน เป้าหุ่นเงาคน มีคะแนน 3 คะแนน และ 7 ถึง 10 คะแนน เป้ารูปวงรี มีคะแนน 10 คะแนน',
                        ],
                      ),
                      _buildListItem(
                          context,
                          'ท่าทางการยิง',
                          'อาวุธปืนบรรจุกระสุนปืนพร้อมยิง เก็บปืนใส่ซอง ยืนในท่าตรง ',
                          [
                            'อาวุธปืนประเภท Single Action ให้ขึ้นระบบห้ามไกปืน ',
                            'อาวุธปืนประเภท Double Action ให้ทำการลดนกปืน '
                          ]),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'ท่าทางการยิง ทำการยิงในระดับหัวไหล่ แนวปืนชี้ไปยังแนวเป้า ถ้าการปฏิบัติของผู้เข้าทำการทดสอบ ผู้ควบคุมการยิงเห็นว่าไม่ปลอดภัยน่าจะเป็นอันตราย มีสิทธิ์ให้ออกจากการทดสอบ')),
                      _buildListItem(context, 'การนับคะแนน ', '', [
                        'เป้าหุ่นเงาคนครึ่งตัว บริเวณพื้นที่บอกคะแนน 3 ,7,8,9,10 คะแนน และวง Xเท่า 10 คะแนน ',
                        'การนับคะแนนให้นับคะแนนตามเส้นเขตที่แบ่งไว้ในเป้า ถ้ารอยกระสุนปืนสัมผัสเส้นแบ่งเขตเป้า ให้ถือค่าคะแนนตามบริเวณคะแนนที่สูงกว่า ',
                        'เป้ารูปวงรี เท่ากับ 10 คะแนน ',
                        'ห้ามใช้อุปกรณ์อย่างใดอย่างหนึ่งแตะต้องหรือสัมผัสรอยกระสุนปืนบนแผ่นเป้า ตรวจสอบพบถือเป็นโมฆะ ',
                        'การนับคะแนน ให้นับคะแนนตามรอยกระสุนปืนที่ปรากฏอยู่ในเป้า โดยคะแนนทั้งสองเปูา รวมกัน 500 คะแนน  - เป้าหุ่นเงาคนครึ่งตัว คะแนนเต็ม 400 คะแนน - เป้ารูปวงรี คะแนนเต็ม 100 คะแนน ',
                        'กรณีรอยกระสุนปืนเกินอยู่ในเป้า : ตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวา ถ้ามีรอยกระสุนปืนในเป้าของ ทางซ้ายหรือขวาไม่ครบ ให้ตัดคะแนนของรอยกระสุนปืนที่ได้คะแนนต่ำสุดที่ปรากฏในเป้าที่เกินออกไป ถ้าตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวาแล้ว ปรากฏว่ามีรอยกระสุนปืน ของเป้าทางซ้ายและขวาครบ ให้ตัดคะแนนสูงสุดของรอยกระสุนปืนที่เกินออกไป',
                      ]),
                      const Text(
                          'Reference from https://policetraining9.com/index.php?option=com_attachments&task=download&id=281'),
                    ]))),
                  if (mode == 4)
                    Flexible(
                        child: SingleChildScrollView(
                            child: Column(children: [
                      _buildListItem(
                          context,
                          'C.A.R. System ',
                          'Center Axis Relock System เป็นรูปแบบการยิงปืนที่ Mr. Paul Castle เป็นผู้คิดขึ้นในปี 1995 โดย C.A.R. System เหมาะกับการยิงปืนในระยะใกล้ (Closed quarter battle, CQB) อีกทั้ง ลดโอกาสที่จะถูกแย่งปืน รูปแบบการยิงนี้ประกอบด้วย 4 ท่าหลัก ๆคือ',
                          [
                            'High position เป็นการถือปืนระดับอก โดยกางข้อศอกออกมือทั้งสองข้างกำด้ามปืนอยู่ระดับอก หันปากกระบอกปืนชี้เข้าหาเป้าหมาย หากจำเป็นต้องยิงก็สามารถทำการยิงได้เลยในท่านี้ และถ้ามีหลายเป้าหมายก็แค่หมุนสะโพกวาดปืนไปในทิศทางที่ต้องการยิง ',
                            'Combat high position เป็นท่าเตรียมพร้อมและใช้ตรวจการณ์ โดยยกปืนขึ้นมาใกล้ใบหน้าแต่ปากกระบอกปืนลดต่ำชี้ลงล่าง งอข้อศอกทั้งสองข้างโดยข้างหนึ่งจะอยู่ใต้ปืนซึ่งจะทำให้รับแรงสะบัดของปืนขณะยิงได้ดีขึ้นจึงยิงต่อเนื่องได้เร็ว',
                            'Extended position เป็นท่ายิงระดับสายตา โดยกระดกปากกระบอกปืนขึ้นมา เล็งผ่านศูนย์ปืนด้วยตาซ้าย (ตาข้างตรงข้ามกับมือหลักที่ถือปืน) โดยเน้นที่ศูนย์หลังไม่ใช่ศูนย์หน้า ปืนอาจเอียงได้เล็กน้อยเพื่อให้สามารถถือปืนได้กระชับมากขึ้นและเป็นธรรมชาติ ข้อศอกยังงออยู่ และปืนอยู่ใกล้ใบหน้า เนื่องจากระยะทางที่ปากกระบอกปืนต้องเดินทางจากท่า Combat high มายังท่า Extended สั้นมากดังนั้นจึงสามารถเริ่มทำการยิงได้อย่างรวดเร็ว ',
                            'Apogee แปลตามตัวว่า จุดสูงสุด เป็นท่าที่ยืดแขนทั้งสองข้างออกไปเล็กน้อย มีความแม่นยำมากขึ้น มีประโยชน์มากเมื่อต้องยิงเป้าหมายในระยะที่ไกลออกไป และอาจเล็งปืนด้วยตาข้างถนัดได้ มีลักษณะคล้ายท่า Weaver รูปแบบการยิงนี้อาศัยการกําด้ามปืนที่เป็นธรรมชาติเพื่อให้คุมปืนได้ง่ายขึ้น ',
                            'การนับคะแนน ให้นับคะแนนตามรอยกระสุนปืนที่ปรากฏอยู่ในเป้า โดยคะแนนทั้งสองเปูา รวมกัน 500 คะแนน  - เป้าหุ่นเงาคนครึ่งตัว คะแนนเต็ม 400 คะแนน - เป้ารูปวงรี คะแนนเต็ม 100 คะแนน ',
                            'กรณีรอยกระสุนปืนเกินอยู่ในเป้า : ตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวา ถ้ามีรอยกระสุนปืนในเป้าของ ทางซ้ายหรือขวาไม่ครบ ให้ตัดคะแนนของรอยกระสุนปืนที่ได้คะแนนต่ำสุดที่ปรากฏในเป้าที่เกินออกไป ถ้าตรวจสอบรอยกระสุนปืนจากเป้าทางซ้ายและขวาแล้ว ปรากฏว่ามีรอยกระสุนปืน ของเป้าทางซ้ายและขวาครบ ให้ตัดคะแนนสูงสุดของรอยกระสุนปืนที่เกินออกไป',
                          ]),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'C.A.R. System นี้จะมีประโยชน์มากหากนํามาใช้ในสถานการณ์ที่เหมาะสม เช่น ในบริเวณ พื้นที่คับแคบ ทางเดินคับแคบ บันได รถยนต์ส่วนตัว รถยนตร์โดยสาร บนเครื่องบิน เป็นต้น')),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'การยิงหลายนัดหลายเป้าหมายนั้นเราต้องให้ความสําคัญกับความแม่นยํามากกว่าความเร็ว กระสุนที่พลาดเป้าอาจไปถูกบุคคลอื่นที่ไม่เกี่ยวข้อง การฝึกฝนบ่อย ๆ จะทําให้เรารู้ความสมดุล ระหว่างความแม่นยํากับความเร็ว (Precision and speed) ของตัวเราเอง')),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'TAS นําบางส่วนของรูปแบบนี้มาประกอบกับท่ายิงอื่น ๆ ซึ่งผู้รับการฝึกสามารถนํามาปรับใช้ ให้เหมาะสมกับตนเองและสถานการณ์ได้')),
                    ]))),
                  if (mode == 5)
                    Flexible(
                        child: SingleChildScrollView(
                            child: Column(children: [
                      _buildListItem(
                          context,
                          'ปืนสั้นในปัจจุบันมีกลไกให้เลือก 2 แบบ คือแบบลูกโม่และแบบเซมิออโต้',
                          'แบบลูกโม่', [
                        'ปืนลูกโม่ ตามที่ชื่อบอก จะบรรจุในโม่ทรงกลมได้ 5, 6, หรือ 7 นัด (อาจจะมากกว่านั้นสำหรับปืนที่ใช้กระสุนขนาดเล็กเช่น .22) เมื่อยิงไปแล้วโม่จะหมุนวนเอากระสุนนัดใหม่เข้ามาให้ยิงได้ต่อ ',
                        'ปืนลูกโม่เป็นปืนที่มีกลไกเข้าใจง่าย, ใช้งานง่ายไม่ซับซ้อน และแทบไม่มีโอกาสติดขัด การบรรจุและเลิกบรรจุกระสุนทำได้ง่ายมาก เห็นชัดเข้าใจง่าย',
                        'ปืนลูกโม่นั้นเมื่อบรรจุกระสุนเข้าในโม่แล้ว ปืนจะพร้อมใช้ทันที เพียงแต่เหนี่ยวไกเท่านั้น ไกระบบดับเบิ้ลแอ๊คชั่นนั้นก็ลากยาวและหนักทำให้ค่อนข้างปลอดภัย เมื่อต้องการเลิกบรรจุก็เพียงเปิดโม่เทกระสุนออกให้หมดซึ่งก็จะเห็นได้ชัดเจนไม่ซับซ้อน ปืนลูกโม่จึงเป็นปืนที่เหมาะมากสำหรับเป็นปืนป้องกันตัวสำหรับมือใหม่',
                        'ปืนสั้นกึ่งอัตโนมัติ หรือ เซมิออโต้ (บางครั้งเรียกกันสั้นๆว่าปืนออโต้) เป็นปืนที่บรรจุกระสุนในซองกระสุน (แม็กกาซีน) เอาซองกระสุนใส่ในตัวปืน เมื่อยิงไปหนึ่งนัด กลไกจะทำการสลัดปลอกกระสุนที่ยิงไปแล้วออกและป้อนกระสุนนัดใหม่เข้ารังเพลิงเพื่อให้พร้อมยิงต่อโดยอัตโนมัติ',
                      ]),
                      const Padding(
                          padding:
                              EdgeInsets.symmetric(horizontal: 16, vertical: 8),
                          child: Text(
                              'ข้อดีของปืนเซมิออโต้ คือบรรจุกระสุนได้มาก บรรจุเพิ่มได้เร็วโดยการเปลี่ยนแม็กกาซีนแต่ปืนเซมิออโต้ก็มีกลไกที่ซับซ้อนกว่า')),
                      _buildListItem(
                          context, '', 'กลไกของปืนเซมิออโต้มีทั้งหมด 4 แบบ', [
                        'ปืนลูกโม่ ตามที่ชื่อบอก จะบรรจุในโม่ทรงกลมได้ 5, 6, หรือ 7 นัด (อาจจะมากกว่านั้นสำหรับปืนที่ใช้กระสุนขนาดเล็กเช่น .22) เมื่อยิงไปแล้วโม่จะหมุนวนเอากระสุนนัดใหม่เข้ามาให้ยิงได้ต่อ ',
                        'ปืนลูกโม่เป็นปืนที่มีกลไกเข้าใจง่าย, ใช้งานง่ายไม่ซับซ้อน และแทบไม่มีโอกาสติดขัด การบรรจุและเลิกบรรจุกระสุนทำได้ง่ายมาก เห็นชัดเข้าใจง่าย',
                        'ปืนลูกโม่นั้นเมื่อบรรจุกระสุนเข้าในโม่แล้ว ปืนจะพร้อมใช้ทันที เพียงแต่เหนี่ยวไกเท่านั้น ไกระบบดับเบิ้ลแอ๊คชั่นนั้นก็ลากยาวและหนักทำให้ค่อนข้างปลอดภัย เมื่อต้องการเลิกบรรจุก็เพียงเปิดโม่เทกระสุนออกให้หมดซึ่งก็จะเห็นได้ชัดเจนไม่ซับซ้อน ปืนลูกโม่จึงเป็นปืนที่เหมาะมากสำหรับเป็นปืนป้องกันตัวสำหรับมือใหม่',
                        'ปืนสั้นกึ่งอัตโนมัติ หรือ เซมิออโต้ (บางครั้งเรียกกันสั้นๆว่าปืนออโต้) เป็นปืนที่บรรจุกระสุนในซองกระสุน (แม็กกาซีน) เอาซองกระสุนใส่ในตัวปืน เมื่อยิงไปหนึ่งนัด กลไกจะทำการสลัดปลอกกระสุนที่ยิงไปแล้วออกและป้อนกระสุนนัดใหม่เข้ารังเพลิงเพื่อให้พร้อมยิงต่อโดยอัตโนมัติ',
                      ]),
                      const Text(
                          'Reference from ปืนสั้น ปืนกระบอกแรกสำหรับการป้องกันตัว | ThailandOutdoor Netzine'),
                    ]))),
                ],
              ),
            ),
          ),
        ),
      ]),
    );
  }
}

Widget _buildListItem(
  BuildContext context,
  String title,
  String subtitle,
  List<String> bullets,
) {
  return Padding(
    padding: const EdgeInsets.symmetric(horizontal: 16, vertical: 8),
    child: Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
          title,
          style: Theme.of(context).textTheme.titleLarge,
        ),
        const SizedBox(height: 8),
        Text(subtitle),
        const SizedBox(height: 8),
        if (bullets.isNotEmpty)
          Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              for (final bullet in bullets)
                Padding(
                  padding: const EdgeInsets.symmetric(vertical: 2),
                  child: Row(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        const Text(
                          '•',
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                            fontSize: 16,
                          ),
                        ),
                        const SizedBox(width: 8),
                        Expanded(
                          child: Text(
                            bullet,
                            style: TextStyle(fontSize: 16),
                          ),
                        ),
                      ]),
                ),
            ],
          ),
      ],
    ),
  );
}
